# Используем официальный образ Python
FROM python:3.12-slim

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файл с зависимостями (если он уже существует)
# В будущем сюда будет добавлен requirements.txt
COPY requirements.txt ./

# Устанавливаем зависимости (если файл с зависимостями существует)
# Важно: сейчас эта строка будет игнорироваться, пока не добавите файл requirements.txt
RUN pip install --no-cache-dir -r requirements.txt

# Копируем все остальные файлы проекта (когда они появятся)
COPY . .

# Открываем порт, если приложение будет работать на определенном порту (например, Flask, FastAPI)
EXPOSE 8080

# Команда по умолчанию для запуска приложения (замените на нужную команду, когда проект будет готов)
# Например, для запуска Flask-приложения это может быть: CMD ["python", "app.py"]
# CMD ["ls", "-l"]
CMD python3 ./src/main.py  # Замените на реальную команду позже